app/controllers/imports_controller.rb

  def create
    Import.create params.required(:import).permit(:csv_file)
---
INSERT INTO "imports" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-05-26 07:14:42.007854"], ["updated_at", "2021-05-26 07:14:42.007854"]]