app/controllers/users_controller.rb

  def index
    term = params[:term]
    page = params[:page] || 1
    per = params[:per] || 10

    @users = User.search(term).order(:first_name).page(page).per(per)
---
SELECT COUNT(*) FROM "users" WHERE (search_text like '%b%')
SELECT "users".* FROM "users" WHERE (search_text like '%${term}%') ORDER BY "users"."first_name" ASC LIMIT ? OFFSET ?  [["LIMIT", 11], ["OFFSET", 0]]