app/models/user.rb

  def self.add(attrs)
    first_name, last_name = break_down_name(attrs.delete('name'))
    user = find_or_initialize_by(first_name: first_name.titleize,
                                 last_name: last_name.titleize)
    user.assign_attributes(attrs)
    user.save
---
UPDATE "users" SET "search_text" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["search_text", "darth vadar male tiefighter human lightsaber"], ["updated_at", "2021-06-01 03:17:35.048927"], ["id", 1]]
INSERT INTO "users" ("first_name", "last_name", "vehicle", "gender", "species", "weapon", "search_text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def assign_afflictions
    return if affiliation.blank?

    user_affiliations.find_or_create_by(affiliation: Affiliation.fetch_by_name(affiliation))
---
INSERT INTO "user_affiliations" ("user_id", "affiliation_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["affiliation_id", 1], ["created_at", "2021-06-01 05:45:14.350476"], ["updated_at", "2021-06-01 05:45:14.350476"]]
SELECT "user_affiliations".* FROM "user_affiliations" WHERE "user_affiliations"."user_id" = ? AND "user_affiliations"."affiliation_id" = ? LIMIT ?  [["user_id", 1], ["affiliation_id", 1], ["LIMIT", 1]]

  def assign_locations
    return if location.blank?

    user_locations.find_or_create_by(location: Location.fetch_by_address(location))
---
INSERT INTO "user_locations" ("user_id", "location_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["location_id", 2], ["created_at", "2021-06-01 05:45:14.453117"], ["updated_at", "2021-06-01 05:45:14.453117"]]
SELECT "user_locations".* FROM "user_locations" WHERE "user_locations"."user_id" = ? AND "user_locations"."location_id" = ? LIMIT ?  [["user_id", 2], ["location_id", 2], ["LIMIT", 1]]